app/controllers/answers_controller.rb

  def create
    question = Question.find(params[:answer][:question_id])
    question.answers.create(answer_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "answers" ("question_id", "email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 1], ["email", "custom@domain.com"], ["body", "DUH"], ["created_at", 2017-01-13 17:18:24 UTC], ["updated_at", 2017-01-13 17:18:24 UTC]]