app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order(created_at: :desc)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY "answers"."created_at" DESC  [["question_id", 1]]

  def create
    Question.create(question_params)
---
INSERT INTO "questions" ("email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "you@email.com"], ["body", "You have a question"], ["created_at", 2017-01-12 21:44:55 UTC], ["updated_at", 2017-01-12 21:44:55 UTC]]